samples/sb2bi-ftp-testplan-firstplan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="SB2Bi FTP Test Plan -5 partners put file every 1 second for 5 times" enabled="true">
      <stringProp name="TestPlan.comments">Sterling B2B Integrator - FTP Test Plan</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">5</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <FTPSampler guiclass="FtpTestSamplerGui" testclass="FTPSampler" testname="FTP-put-testdata01.txt-demo_partner01" enabled="true">
          <stringProp name="FTPSampler.server">10.1.1.10</stringProp>
          <stringProp name="FTPSampler.port">5032</stringProp>
          <stringProp name="FTPSampler.filename">/testdata01.txt</stringProp>
          <stringProp name="FTPSampler.localfilename">/demo-data/testdata01_billing.txt</stringProp>
          <boolProp name="FTPSampler.binarymode">false</boolProp>
          <boolProp name="FTPSampler.saveresponse">false</boolProp>
          <boolProp name="FTPSampler.upload">true</boolProp>
          <stringProp name="ConfigTestElement.username">demo_partner01</stringProp>
          <stringProp name="ConfigTestElement.password">passw0rd</stringProp>
        </FTPSampler>
        <hashTree/>
        <FTPSampler guiclass="FtpTestSamplerGui" testclass="FTPSampler" testname="FTP-put-testdata01.txt-demo_partner02" enabled="true">
          <stringProp name="FTPSampler.server">10.1.1.10</stringProp>
          <stringProp name="FTPSampler.port">5032</stringProp>
          <stringProp name="FTPSampler.filename">/testdata01.txt</stringProp>
          <stringProp name="FTPSampler.localfilename">/demo-data/testdata01_billing.txt</stringProp>
          <boolProp name="FTPSampler.binarymode">false</boolProp>
          <boolProp name="FTPSampler.saveresponse">false</boolProp>
          <boolProp name="FTPSampler.upload">true</boolProp>
          <stringProp name="ConfigTestElement.username">demo_partner02</stringProp>
          <stringProp name="ConfigTestElement.password">passw0rd</stringProp>
        </FTPSampler>
        <hashTree/>
        <FTPSampler guiclass="FtpTestSamplerGui" testclass="FTPSampler" testname="FTP-put-testdata01.txt-demo_partner03" enabled="true">
          <stringProp name="FTPSampler.server">10.1.1.10</stringProp>
          <stringProp name="FTPSampler.port">5032</stringProp>
          <stringProp name="FTPSampler.filename">/testdata01.txt</stringProp>
          <stringProp name="FTPSampler.localfilename">/demo-data/testdata01_billing.txt</stringProp>
          <boolProp name="FTPSampler.binarymode">false</boolProp>
          <boolProp name="FTPSampler.saveresponse">false</boolProp>
          <boolProp name="FTPSampler.upload">true</boolProp>
          <stringProp name="ConfigTestElement.username">demo_partner03</stringProp>
          <stringProp name="ConfigTestElement.password">passw0rd</stringProp>
        </FTPSampler>
        <hashTree/>
        <FTPSampler guiclass="FtpTestSamplerGui" testclass="FTPSampler" testname="FTP-put-testdata01.txt-demo_partner04" enabled="true">
          <stringProp name="FTPSampler.server">10.1.1.10</stringProp>
          <stringProp name="FTPSampler.port">5032</stringProp>
          <stringProp name="FTPSampler.filename">/testdata01.txt</stringProp>
          <stringProp name="FTPSampler.localfilename">/demo-data/testdata01_billing.txt</stringProp>
          <boolProp name="FTPSampler.binarymode">false</boolProp>
          <boolProp name="FTPSampler.saveresponse">false</boolProp>
          <boolProp name="FTPSampler.upload">true</boolProp>
          <stringProp name="ConfigTestElement.username">demo_partner04</stringProp>
          <stringProp name="ConfigTestElement.password">passw0rd</stringProp>
        </FTPSampler>
        <hashTree/>
        <FTPSampler guiclass="FtpTestSamplerGui" testclass="FTPSampler" testname="FTP-put-testdata01.txt-demo_partner05" enabled="true">
          <stringProp name="FTPSampler.server">10.1.1.10</stringProp>
          <stringProp name="FTPSampler.port">5032</stringProp>
          <stringProp name="FTPSampler.filename">/testdata01.txt</stringProp>
          <stringProp name="FTPSampler.localfilename">/demo-data/testdata01_billing.txt</stringProp>
          <boolProp name="FTPSampler.binarymode">false</boolProp>
          <boolProp name="FTPSampler.saveresponse">false</boolProp>
          <boolProp name="FTPSampler.upload">true</boolProp>
          <stringProp name="ConfigTestElement.username">demo_partner05</stringProp>
          <stringProp name="ConfigTestElement.password">passw0rd</stringProp>
        </FTPSampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>